OrgMode/todo.org
#+STARTUP: showall
#+TODO: TODO IN-PROGRESS WAITING DONE
* Time for some Todos!
- Todos can be created easily by including "~TODO~" at the start of a line
- You can easily cycle todo states with ~S-left/right~, by default there's ~TODO~, ~DONE~ and empty
- You can display only the TODOs in your document with ~<leader> T~
- You can add extra states with the configuration line ~#+TODO~
  - To apply the configuration line, either re-open the document or go to the top of the file and use ~<leader> <leader>~
  - Optionally you can also add the following code to your init file to add it in all org files
  #+BEGIN_SRC emacs-lisp
    (setq org-todo-keywords
          '((sequence "TODO" "IN-PROGRESS" "WAITING" "DONE")))
  #+END_SRC
  - Another note: source blocks like the above can be edited with ~<leader> <quote>~ while on the ~BEGIN~ line
* Let's create some TODO's
** don't need to buy toilet paper
** TODO buy an airplane
** IN-PROGRESS grab a valentines gift
** WAITING create the next skynet
** DONE clean the cat litter
CLOSED: [2016-02-01 Mon 15:15]
