OrgMode/todo.tex
% Created 2016-02-02 Tue 16:07
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\date{\today}
\title{}
\hypersetup{
 pdfauthor={},
 pdftitle={},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 24.5.1 (Org mode 8.3.3)},
 pdflang={English}}
\begin{document}

\tableofcontents

\section{Time for some Todos!}
\label{sec:orgheadline1}
\begin{itemize}
\item Todos can be created easily by including "\texttt{TODO}" at the start of a line
\item You can easily cycle todo states with \texttt{S-left/right}, by default there's \texttt{TODO}, \texttt{DONE} and empty
\item You can display only the TODOs in your document with \texttt{<leader> T}
\item You can add extra states with the configuration line \texttt{\#+TODO}
\begin{itemize}
\item To apply the configuration line, either re-open the document or go to the top of the file and use \texttt{<leader> <leader>}
\item Optionally you can also add the following code to your init file to add it in all org files
\end{itemize}
\begin{verbatim}
(setq org-todo-keywords
      '((sequence "TODO" "IN-PROGRESS" "WAITING" "DONE")))
\end{verbatim}
\begin{itemize}
\item Another note: source blocks like the above can be edited with \texttt{<leader> <quote>} while on the \texttt{BEGIN} line
\end{itemize}
\end{itemize}
\section{Let's create some TODO's}
\label{sec:orgheadline7}
\subsection{don't need to buy toilet paper}
\label{sec:orgheadline2}
\subsection{{\bfseries\sffamily TODO} buy an airplane}
\label{sec:orgheadline3}
\subsection{{\bfseries\sffamily IN-PROGRESS} grab a valentines gift}
\label{sec:orgheadline4}
\subsection{{\bfseries\sffamily WAITING} create the next skynet}
\label{sec:orgheadline5}
\subsection{{\bfseries\sffamily DONE} clean the cat litter}
\label{sec:orgheadline6}
\end{document}
